# Occupation

### Introduction:

### Step 1. Import the necessary libraries

In [150]:
import pandas as pd

### Step 2. Import the dataset occupation.table

In [151]:
df = pd.read_csv("./occupation.table.txt", sep = "|")

### Step 3. Assign it to a variable called users.

In [152]:
users = df

In [153]:
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [154]:
users.groupby("occupation").age.mean().round(2)

occupation
administrator    38.75
artist           31.39
doctor           43.57
educator         42.01
engineer         36.39
entertainment    29.22
executive        38.72
healthcare       41.56
homemaker        32.57
lawyer           36.75
librarian        40.00
marketing        37.62
none             26.56
other            34.52
programmer       33.12
retired          63.07
salesman         35.67
scientist        35.55
student          22.08
technician       33.15
writer           36.31
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [155]:
users_occupation_male = users[users["gender"] == "M"]

In [156]:
users_occupation_male_ratio = users_occupation_male["occupation"].value_counts() / users["occupation"].value_counts()
users_occupation_male_ratio.sort_values(ascending = False).round(2)

doctor           1.00
engineer         0.97
technician       0.96
retired          0.93
programmer       0.91
executive        0.91
scientist        0.90
entertainment    0.89
lawyer           0.83
salesman         0.75
educator         0.73
student          0.69
other            0.66
marketing        0.62
writer           0.58
none             0.56
administrator    0.54
artist           0.54
librarian        0.43
healthcare       0.31
homemaker        0.14
Name: occupation, dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [157]:
users_occupation_age_min = users.groupby("occupation").min().age
users_occupation_age_max = users.groupby("occupation").max().age
users_occupation_age = pd.concat([occupation_age_min, occupation_age_max], axis=1)
users_occupation_age.columns = ["minimum age", "maximum age"]
users_occupation_age

               minimum age  maximum age
occupation
administrator           21           70
artist                  19           48
doctor                  28           64
educator                23           63
engineer                22           70
entertainment           15           50
executive               22           69
healthcare              22           62
homemaker               20           50
lawyer                  21           53
librarian               23           69
marketing               24           55
none                    11           55
other                   13           64
programmer              20           63
retired                 51           73
salesman                18           66
scientist               23           55
student                  7           42
technician              21           55
writer                  18           60

### Step 7. For each combination of occupation and gender, calculate the mean age

In [158]:
users.groupby(["occupation", "gender"]).age.mean().round(2)

occupation     gender
administrator  F         40.64
               M         37.16
artist         F         30.31
               M         32.33
doctor         M         43.57
educator       F         39.12
               M         43.10
engineer       F         29.50
               M         36.60
entertainment  F         31.00
               M         29.00
executive      F         44.00
               M         38.17
healthcare     F         39.82
               M         45.40
homemaker      F         34.17
               M         23.00
lawyer         F         39.50
               M         36.20
librarian      F         40.00
               M         40.00
marketing      F         37.20
               M         37.88
none           F         36.50
               M         18.60
other          F         35.47
               M         34.03
programmer     F         32.17
               M         33.22
retired        F         70.00
               M         62.54
salesman       F         27.00
               M         38.56
scientist      F         28.33
               M         36.32
student        F         20.75
               M         22.67
technician     F         38.00
               M         32.96
writer         F         37.63
               M         35.35
Name: age, dtype: float64

### Step 8.  For each occupation present the percentage of women and men

In [159]:
users_occupation_female = users[users["gender"] == "F"]

In [160]:
users_occupation_female_ratio = users_occupation_female["occupation"].value_counts() / users["occupation"].value_counts()

In [161]:
users_occupation_gender_ratio = pd.concat([users_occupation_male_ratio*100, users_occupation_female_ratio*100], axis=1)
users_occupation_gender_ratio.columns = ["% Male", "% Female"]
users_occupation_gender_ratio.fillna(0).round(2)

               % Male  % Female
administrator   54.43     45.57
artist          53.57     46.43
doctor         100.00      0.00
educator        72.63     27.37
engineer        97.01      2.99
entertainment   88.89     11.11
executive       90.62      9.38
healthcare      31.25     68.75
homemaker       14.29     85.71
lawyer          83.33     16.67
librarian       43.14     56.86
marketing       61.54     38.46
none            55.56     44.44
other           65.71     34.29
programmer      90.91      9.09
retired         92.86      7.14
salesman        75.00     25.00
scientist       90.32      9.68
student         69.39     30.61
technician      96.30      3.70
writer          57.78     42.22